hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/elektra/cdm/v1/ElektraService_02/AKMTR.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <v1:updateCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <v1:AKM-TR>
                <v1:absender>
                    <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                </v1:absender>
                <v1:empfaenger>
                    <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                </v1:empfaenger>
                <v1:version>0</v1:version>
                <v1:vorabstimmungsIdRef>${preAgreementId}</v1:vorabstimmungsIdRef>
                <v1:endkundenvertragspartner>
                    <v1:EKPauf>
                        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                    </v1:EKPauf>
                    <v1:EKPabg>
                        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                    </v1:EKPabg>
                </v1:endkundenvertragspartner>
                <v1:geschaeftsfall>VA-KUE-MRN</v1:geschaeftsfall>
                <v1:position>
                    <v1:Meldungscode>8010</v1:Meldungscode>
                    <v1:Meldungstext>Antwort des aufnehmenden Anbieters</v1:Meldungstext>
                </v1:position>
                <v1:ressourcenuebernahme>true</v1:ressourcenuebernahme>
                <v1:uebernahmeLeitung>
                    <v1:vertragsnummer>V123456</v1:vertragsnummer>
                </v1:uebernahmeLeitung>
                <v1:sichererHafen>true</v1:sichererHafen>
                <v1:portierungskennungPKIauf>D001</v1:portierungskennungPKIauf>
            </v1:AKM-TR>
        </v1:updateCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>